app/Controllers/Auth/Auth.php

    public function login()
    {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $user = $this->akunModel->where('email', $email)->first();
---
SELECT *
FROM `akun`
WHERE `email` = '1@gmail.com'
 LIMIT 1