app/Controllers/Public/Dashboard.php

    public function index()
    {
        $data =
        [
        'produk' => $this->produkModel
                ->join('kategori', 'produk.id_kategori = kategori.id_kategori')
                ->limit(3)
                ->findAll(),
        'iklan' => $this->iklanModel
                ->where('nama_iklan', 'popup') // Mengganti 'iklan' dengan 'jenis_iklan' dan menggunakan nilai 'popup'
                ->findAll(),
        'keranjang' => $this->keranjangModel
                ->join('akun', 'keranjang.id_akun = akun.id_akun')
                ->where('keranjang.id_akun', session('id_akun'))
                ->countAllResults(),
---
SELECT *
FROM `iklan`
WHERE `nama_iklan` = 'popup'
SELECT COUNT(*) AS `numrows`
FROM `keranjang`
JOIN `akun` ON `keranjang`.`id_akun` = `akun`.`id_akun`
WHERE `keranjang`.`id_akun` IS NULL

    public function shop()
    {
    $data =
    [
    'produk' => $this->produkModel
            ->join('kategori', 'produk.id_kategori = kategori.id_kategori')
            ->findAll(),
    'iklan' => $this->iklanModel
            ->where('nama_iklan', 'banner') // Mengganti 'iklan' dengan 'jenis_iklan' dan menggunakan nilai 'popup'
            ->findAll(),
    'keranjang' => $this->keranjangModel
            ->join('akun', 'keranjang.id_akun = akun.id_akun')
            ->where('keranjang.id_akun', session('id_akun'))
            ->countAllResults(),
---
SELECT *
FROM `iklan`
WHERE `nama_iklan` = 'banner'
SELECT COUNT(*) AS `numrows`
FROM `keranjang`
JOIN `akun` ON `keranjang`.`id_akun` = `akun`.`id_akun`
WHERE `keranjang`.`id_akun` IS NULL