app/Controllers/Admin/Iklan/Create.php

INSERT INTO `iklan` (`nama_iklan`, `gambar_iklan`, `deskripsi_iklan`) VALUES ('banner', '1704207915_bd2887c9eb70381420de.png', 'mang eak')
---
    public function index()
    {
        if (!$this->request->is('post')) {
            $data = [
                'title' => 'Admin - Tambah iklan',
            ];
            return view('admin/iklan/create', $data);
        }

        $newFileName = ''; // Inisialisasi dengan nilai default kosong
        $gambariklan = $this->request->getFile('gambar_iklan');
        $newFileName = $gambariklan->getRandomName();
        $gambariklan->move(ROOTPATH . 'public/uploads/iklan', $newFileName);


        $iklanData = [
            'nama_iklan' => $this->request->getPost('nama_iklan'),
            'gambar_iklan' => $newFileName,
            'deskripsi_iklan' => $this->request->getPost('deskripsi_iklan'),
        ];

        $this->iklanModel->insert($iklanData);