app/Controllers/Admin/Iklan/Read.php

SELECT *
FROM `iklan`
---
    public function index()
    {
        $iklan =  $this->iklanModel
        ->findAll();