app/Controllers/Admin/Produk/Create.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        if (!$this->request->is('post')) {
            $data = [
                'title' => 'Admin - Tambah Produk',
                'kategori' => $this->kategoriModel->findAll(),

INSERT INTO `produk` (`id_kategori`, `sku`, `nama_produk`, `harga`, `stok`, `berat`, `gambar_produk`, `deskripsi`, `created_at`, `updated_at`) VALUES ('1', '230940958', 'ECOPRINT PILLOW', '110000', '17', '25', '1702291696_307b7619b2a38953b572.jpg', 'Bantal Sofa Lembut', '2023-12-11 10:48:16', '2023-12-11 10:48:16')
---
            'deskripsi' => $this->request->getPost('deskripsi'),
        ];

        $this->produkModel->insert($produkData);